# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input('Введите трехзначное число '))
print(f'Сумма цифр числа {a} равна {int(a//100)+int(a%100)//10+int(a%10)} ')

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

s = int(input('Введите количество журавликов '))
print(f'Петя сделал {int(s/6)} журавликов, Сережа сделал {int(s/6)} журавликов, Катя сделала {int(s/6*4)} журавликов ')


# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали
# билет с номером. Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый,
# т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

a = int(input('Введите шестизначное число число '))
if a//100000+a%100000//10000+a%10000//1000==a%1000//100+a%100//10+a%10:
    print(f'yes')
else:
    print(f'no')


# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no

m = int(input('Введите количество долек по горизонтали '))
n = int(input('Введите количество долек по вертикали '))
k = int(input('Сколько долек надо отломить '))
if k%m==0 or k%n==0:
    print(f'yes')
else:
    print(f'no')
